#### ExportLinetypeKey Members

---

|  |
| --- |
| ExportLinetypeKey Class   Constructors   Methods   Properties   See Also |

The  ExportLinetypeKey  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLinetypeKey | Constructs a new default ExportLinetypeKey. |
| Public method | ExportLinetypeKey(String) | Constructs a new default ExportLinetypeKey using the original line type name as input. |
| Public method | ExportLinetypeKey(ExportLinetypeKey) | Constructs a new copy of the input ExportLinetypeKey object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportLinetypeKey |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OriginalLinetypeName | The original linetype name. |

# See Also

ExportLinetypeKey Class

Autodesk.Revit.DB Namespace